using System;
namespace program_1
{
    delegate void Print(string str);

    static class ProgramData
    {
        public const int speed = 10;
        private static string[] nums = { "минус ", "нулевой", "первый ", "второй ", "третий ",
                                           "четвертый ", "пятый ", "шестой ", "седьмой ", "восьмой ",
                                           "девятый ", "десятый ", "одиннадцатый ", "двенадцатый ", "тринадцатый ",
                                           "четырнадцатый ", "пятнадцатый ", "шестнадцатый ", "семнадцатый ", "восемнадцатый ",
                                           "девятнадцатый ", "двадцатый ", "тридцатый ", "сороковой ", "пятидесятый ",
                                           "шестидесятый ", "семидесятый ", "восмидесятый ", "девяностый ", "двадцать ",
                                           "тридцать ", "сорок ", "пятьдесят ", "шестьдесят ", "семдесят ",
                                           "восемдесят ", "девяносто ", "сотый ", "двухсотый ", "трехсотый ",
                                           "четырехсотый ", "пятисотый ", "шестисотый ", "восмисотый ", "девятисотый ",
                                           "сто ", "двести ", "триста ", "четыресто ", "пятьсот ",
                                           "шестьсот ", "семьсот ", "восемсот ", "девятсот ", "тысячный ",
                                           "K+"};

        public static string NumToString(int n)
        {
            if (n == 0)
                return nums[1];
            if (n > 1000)
                return nums[55];

            string result = "";
            if (n < 0)
            {
                result += nums[0];
                n = Math.Abs(n);
            }
            if (n == 1000)
                result += nums[54];
            else
            {
                if (n % 100 == 0)
                    result += nums[n / 100 + 36];
                else
                {
                    if (n > 99)
                    {
                        result += nums[n / 100 + 44];
                        n = n % 100;
                    }
                    if (n < 20)
                        result += nums[n + 1];
                    else
                    {
                        if (n % 10 == 0)
                            result += nums[n / 10 + 19];
                        else
                            result += nums[n / 10 + 27] + nums[n % 10 + 1];
                    }
                }
            }
            return result.Trim();
        }
    }
}
